Revit 2027 API
BuiltInFailures.SketchFailures.InvalidElevationSketchError Property
 Elevation Profile sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidElevationSketchError { get; }
Public Shared ReadOnly Property InvalidElevationSketchError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidElevationSketchError {
	FailureDefinitionId^ get ();
}
static member InvalidElevationSketchError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace